000001200616/* ========================================================================== */
000002200616/*  TEST001CL  Aufrufen ETSTAMM-Verwaltung                                    */
000003200616/* -------------------------------------------------------------------------- */
000004200616/*  01/29.04.20 DB  1.0   Ersterstellung                                      */
000005200616/*                                                                            */
000006200616/* ========================================================================== */
000007200616           PGM
000008200616
000009200616
000010200616/*  System Variables */
000011200616             DCL        VAR(&ERRORSW)    TYPE(*LGL)
000012200616             DCL        VAR(&PODLIB)     TYPE(*CHAR) LEN(10)
000013200616             DCL        VAR(&DTALIB)     TYPE(*CHAR) LEN(10)
000014200616
000015200616/*  Linkage Variables */
000016200616             DCL        VAR(&INOUTRC)    TYPE(*CHAR) LEN(5)   VALUE(' ')
000017200616             DCL        VAR(&INOUTRCMSG) TYPE(*CHAR) LEN(100) VALUE(' ')
000018200616             DCL        VAR(&INLOCID)    TYPE(*CHAR) LEN(6)   VALUE(' ')
000019200616             DCL        VAR(&INFNKTN)    TYPE(*CHAR) LEN(6)   VALUE(' ')
000020200616             DCL        VAR(&INHERST)    TYPE(*CHAR) LEN(4)   VALUE(' ')
000021200616             DCL        VAR(&INLNR)      TYPE(*CHAR) LEN(2)   VALUE(' ')
000022200616             DCL        VAR(&INTNR)      TYPE(*CHAR) LEN(30)  VALUE(' ')
000023200616             DCL        VAR(&INBENEN)    TYPE(*CHAR) LEN(50)  VALUE(' ')
000024200616             DCL        VAR(&INFIRMA)    TYPE(*CHAR) LEN(2)   VALUE(' ')
000025200616             DCL        VAR(&INFILIAL)   TYPE(*CHAR) LEN(2)   VALUE(' ')
000026200616             DCL        VAR(&INSA)       TYPE(*CHAR) LEN(1)   VALUE(' ')
000027200616             DCL        VAR(&INMC)       TYPE(*CHAR) LEN(6)   VALUE(' ')
000028200616             DCL        VAR(&INEPR)      TYPE(*CHAR) LEN(12)  VALUE(' ')
000029200616             DCL        VAR(&INRGDAG)    TYPE(*CHAR) LEN(2)   VALUE(' ')
000030200616             DCL        VAR(&INTMARKE)   TYPE(*CHAR) LEN(2)   VALUE(' ')
000031200616             DCL        VAR(&INLIWERK)   TYPE(*CHAR) LEN(2)   VALUE(' ')
000032200616             DCL        VAR(&INTA)       TYPE(*CHAR) LEN(2)   VALUE(' ')
000033200616             DCL        VAR(&INLEIART)   TYPE(*CHAR) LEN(2)   VALUE(' ')
000034200616             DCL        VAR(&INLOPA)     TYPE(*CHAR) LEN(8)   VALUE(' ')
000035200616             DCL        VAR(&INGFKZ)     TYPE(*CHAR) LEN(4)   VALUE(' ')
000036200616             DCL        VAR(&INBESVER)   TYPE(*CHAR) LEN(17)  VALUE(' ')
000037200616             DCL        VAR(&INDRTKZ)    TYPE(*CHAR) LEN(2)   VALUE(' ')
000038200616             DCL        VAR(&ININTVKZ)   TYPE(*CHAR) LEN(1)   VALUE(' ')
000039200616             DCL        VAR(&INWINTER)   TYPE(*CHAR) LEN(1)   VALUE(' ')
000040200616             DCL        VAR(&INSKL)      TYPE(*CHAR) LEN(2)   VALUE(' ')
000041200616             DCL        VAR(&INMODUS)    TYPE(*CHAR) LEN(1)   VALUE(' ')
000042200616             DCL        VAR(&INNC)       TYPE(*CHAR) LEN(1)   VALUE(' ')
000043200616             DCL        VAR(&INTAUKZ)    TYPE(*CHAR) LEN(1)   VALUE(' ')
000044200616             DCL        VAR(&INKZEINS)   TYPE(*CHAR) LEN(1)   VALUE(' ')
000045200616             DCL        VAR(&INTIDENT)   TYPE(*CHAR) LEN(1)   VALUE(' ')
000046200616             DCL        VAR(&INTCODE)    TYPE(*CHAR) LEN(3)   VALUE(' ')
000047200616             DCL        VAR(&INTNRV)     TYPE(*CHAR) LEN(30)  VALUE(' ')
000048200616             DCL        VAR(&INTNRN)     TYPE(*CHAR) LEN(30)  VALUE(' ')
000049200616             DCL        VAR(&INTNRH)     TYPE(*CHAR) LEN(40)  VALUE(' ')
000050200616             DCL        VAR(&INDAK)      TYPE(*CHAR) LEN(12)  VALUE(' ')
000051200616             DCL        VAR(&INEKNPR)    TYPE(*CHAR) LEN(12)  VALUE(' ')
000052200616             DCL        VAR(&INNPREIS)   TYPE(*CHAR) LEN(12)  VALUE(' ')
000053200616             DCL        VAR(&INABSCH)    TYPE(*CHAR) LEN(4)   VALUE(' ')
000054200616             DCL        VAR(&INPFAND)    TYPE(*CHAR) LEN(12)  VALUE(' ')
000055200616             DCL        VAR(&INTRUWER)   TYPE(*CHAR) LEN(12)  VALUE(' ')
000056200616             DCL        VAR(&INPRKZ)     TYPE(*CHAR) LEN(1)   VALUE(' ')
000057200616             DCL        VAR(&INKDABS)    TYPE(*CHAR) LEN(1)   VALUE(' ')
000058200616             DCL        VAR(&INENTSOP)   TYPE(*CHAR) LEN(6)   VALUE(' ')
000059200616             DCL        VAR(&INENTSOW)   TYPE(*CHAR) LEN(12)  VALUE(' ')
000060200616             DCL        VAR(&INMWST)     TYPE(*CHAR) LEN(2)   VALUE(' ')
000061200616             DCL        VAR(&INGEWICH)   TYPE(*CHAR) LEN(10)  VALUE(' ')
000062200616             DCL        VAR(&INMINBES)   TYPE(*CHAR) LEN(10)  VALUE(' ')
000063200616             DCL        VAR(&INMAXBES)   TYPE(*CHAR) LEN(10)  VALUE(' ')
000064200616             DCL        VAR(&INSIBES)    TYPE(*CHAR) LEN(10)  VALUE(' ')
000065200616             DCL        VAR(&INBESAUS)   TYPE(*CHAR) LEN(10)  VALUE(' ')
000066200616             DCL        VAR(&INTVOL)     TYPE(*CHAR) LEN(10)  VALUE(' ')
000067200616             DCL        VAR(&INVERP1)    TYPE(*CHAR) LEN(5)   VALUE(' ')
000068200616             DCL        VAR(&INVERP2)    TYPE(*CHAR) LEN(5)   VALUE(' ')
000069200616             DCL        VAR(&INDTVERF)   TYPE(*CHAR) LEN(8)   VALUE(' ')
000070200616             DCL        VAR(&INMIBESM)   TYPE(*CHAR) LEN(10)  VALUE(' ')
000071200616             DCL        VAR(&INZAEGRU)   TYPE(*CHAR) LEN(3)   VALUE(' ')
000072200616             DCL        VAR(&INKZBEVO)   TYPE(*CHAR) LEN(3)   VALUE(' ')
000073200616             DCL        VAR(&INKZRUCK)   TYPE(*CHAR) LEN(1)   VALUE(' ')
000074200616             DCL        VAR(&INDISPO)    TYPE(*CHAR) LEN(1)   VALUE(' ')
000075200616
000076200616           MONMSG     MSGID(CPF0000) EXEC(GOTO MEBCANCEL)
000077200616
000078200616           $RTVJOBA   DTALIB(&DTALIB) PODLIB(&PODLIB)
000079200616           MONMSG     MSGID(MCH0000)  EXEC(GOTO MEBCANCEL)
000080200616
000081200616             CHGVAR  &INLOCID     VALUE('010101')
000082200616             CHGVAR  &INFNKTN     VALUE('      ')
000083200616             CHGVAR  &INHERST     VALUE('DCAG')
000084200616             CHGVAR  &INLNR       VALUE('01')
000085200617             CHGVAR  &INTNR       VALUE('A112233449953')
000086200617             CHGVAR  &INBENEN     VALUE('Filter Part')
000087200616             CHGVAR  &INFIRMA     VALUE('01')
000088200616             CHGVAR  &INFILIAL    VALUE('01')
000089200616             CHGVAR  &INSA        VALUE('1')
000090200616             CHGVAR  &INMC        VALUE('2LU686')
000091200616             CHGVAR  &INEPR       VALUE('100')
000092200616             CHGVAR  &INRGDAG     VALUE('20')
000093200616             CHGVAR  &INTMARKE    VALUE('D ')
000094200616             CHGVAR  &INLIWERK    VALUE('50')
000095200616             CHGVAR  &INTA        VALUE('01')
000096200616             CHGVAR  &INLEIART    VALUE('10')
000097200616             CHGVAR  &INLOPA      VALUE('REGAL')
000099200616             CHGVAR  &INBESVER    VALUE('XXXXXXXXXXXXXXXXX')
000100200616             CHGVAR  &INDRTKZ     VALUE('XY')
000105200616             CHGVAR  &INNC        VALUE('1')
000107200616             CHGVAR  &INKZEINS    VALUE('N')
000113200616             CHGVAR  &INDAK       VALUE('50,25')
000114200616             CHGVAR  &INEKNPR     VALUE('20,32')
000115200616             CHGVAR  &INNPREIS    VALUE('222,95')
000117200616             CHGVAR  &INPFAND     VALUE('77,00')
000119200616             CHGVAR  &INPRKZ      VALUE('K')
000123200616             CHGVAR  &INMWST      VALUE('02')
000124200616             CHGVAR  &INGEWICH    VALUE('0,160')
000129200616             CHGVAR  &INTVOL      VALUE('32,00')
000130200616             CHGVAR  &INVERP1     VALUE('1')
000133200616             CHGVAR  &INMIBESM    VALUE('3333,00')
000134200616             CHGVAR  &INZAEGRU    VALUE('123')
000138200616
000139200616
000140200616           CALL  PGM(OETP001CL) PARM(&INOUTRC &INOUTRCMSG &INLOCID &INFNKTN &INHERST +
000141200616                 &INLNR &INTNR &INBENEN &INFIRMA &INFILIAL &INSA &INMC &INEPR &INRGDAG +
000142200616                 &INTMARKE &INLIWERK &INTA &INLEIART &INLOPA &INGFKZ &INBESVER &INDRTKZ +
000143200616                 &ININTVKZ &INWINTER &INSKL &INMODUS &INNC &INTAUKZ &INKZEINS &INTIDENT +
000144200616                 &INTCODE &INTNRV &INTNRN &INTNRH &INDAK &INEKNPR &INNPREIS +
000145200616                 &INABSCH &INPFAND &INTRUWER &INPRKZ &INKDABS &INENTSOP &INENTSOW +
000146200616                 &INMWST &INGEWICH &INMINBES &INMAXBES &INSIBES &INBESAUS &INTVOL +
000147200616                 &INVERP1 &INVERP2 &INDTVERF &INMIBESM &INZAEGRU &INKZBEVO &INKZRUCK +
000148200616                 &INDISPO)
000149200616
000150200616
000151200616           GOTO        ENDE
000152200616/* -------------------------------------------------------------------------- */
000153200616MEBCANCEL:
000154200616           IF          &ERRORSW SNDPGMMSG MSGID(CPF9999) MSGF(QCPFMSG) MSGTYPE(*ESCAPE)
000155200616           CHGVAR      &ERRORSW '1'
000156200616           CALL        $CLPERRCL
000157200616ENDE:
000158200616           RETURN
000159200616           ENDPGM
